# GetReferences Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Selection..::..GetReferences Method
Selection Class See Also
---
Returns the references that are currently selected.
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<Reference> GetReferences()
```

Visual Basic
---
```text
Public Function GetReferences As IList(Of Reference)
```

Visual C++
---
```text
public:
IList<Reference^>^ GetReferences()
```

# ### Return Value
The collection containing the selected references.
# Remarks
The references can be an element or subelement in the host or a linked document.
# See Also
Selection Class
Autodesk.Revit.UI.Selection Namespace